yoneken/rosserial_stm32/src/ros_lib/examples/Multi-publishers_Environnement&Motion_example/Drivers/BSP/Components/lsm303agr/lsm303agr_reg.h
#define LSM303AGR_REFERENCE_A               0x26U
#define LSM303AGR_STATUS_REG_A              0x27U
typedef struct {
  uint8_t xda                    : 1;
  uint8_t yda                    : 1;
  uint8_t zda                    : 1;
  uint8_t zyxda                  : 1;
  uint8_t _xor                   : 1;
  uint8_t yor                    : 1;
  uint8_t zor                    : 1;
  uint8_t zyxor                  : 1;
} lsm303agr_status_reg_a_t;

#define LSM303AGR_OUT_X_L_A                 0x28U
#define LSM303AGR_OUT_X_H_A                 0x29U
#define LSM303AGR_OUT_Y_L_A                 0x2AU
#define LSM303AGR_OUT_Y_H_A                 0x2BU
#define LSM303AGR_OUT_Z_L_A                 0x2CU
#define LSM303AGR_OUT_Z_H_A                 0x2DU
#define LSM303AGR_FIFO_CTRL_REG_A           0x2EU
typedef struct {
  uint8_t fth                    : 5;
  uint8_t tr                     : 1;
  uint8_t fm                     : 2;
} lsm303agr_fifo_ctrl_reg_a_t;

#define LSM303AGR_FIFO_SRC_REG_A            0x2FU
typedef struct {
  uint8_t fss                    : 5;
  uint8_t empty                  : 1;
  uint8_t ovrn_fifo              : 1;
  uint8_t wtm                    : 1;
} lsm303agr_fifo_src_reg_a_t;

#define LSM303AGR_INT1_CFG_A                0x30U
typedef struct {
  uint8_t xlie                   : 1; /* or XDOWNE */
  uint8_t xhie                   : 1; /* or XUPE */
  uint8_t ylie                   : 1; /* or YDOWNE */
  uint8_t yhie                   : 1; /* or YUPE */
  uint8_t zlie                   : 1; /* or ZDOWNE */
  uint8_t zhie                   : 1; /* or ZUPE */
  uint8_t _6d                    : 1;
  uint8_t aoi                    : 1;
} lsm303agr_int1_cfg_a_t;

#define LSM303AGR_INT1_SRC_A                0x31U
typedef struct {
  uint8_t xl                     : 1;
  uint8_t xh                     : 1;
  uint8_t yl                     : 1;
  uint8_t yh                     : 1;
  uint8_t zl                     : 1;
  uint8_t zh                     : 1;
  uint8_t ia                     : 1;
  uint8_t not_used_01            : 1;
} lsm303agr_int1_src_a_t;

#define LSM303AGR_INT1_THS_A                0x32U
typedef struct {
  uint8_t ths                    : 7;
  uint8_t not_used_01            : 1;
} lsm303agr_int1_ths_a_t;

#define LSM303AGR_INT1_DURATION_A           0x33U
typedef struct {
  uint8_t d                      : 7;
  uint8_t not_used_01            : 1;
} lsm303agr_int1_duration_a_t;

#define LSM303AGR_INT2_CFG_A                0x34U
typedef struct {
  uint8_t xlie                   : 1;
  uint8_t xhie                   : 1;
  uint8_t ylie                   : 1;
  uint8_t yhie                   : 1;
  uint8_t zlie                   : 1;
  uint8_t zhie                   : 1;
  uint8_t _6d                    : 1;
  uint8_t aoi                    : 1;
} lsm303agr_int2_cfg_a_t;

#define LSM303AGR_INT2_SRC_A                0x35U
typedef struct {
  uint8_t xl                     : 1;
  uint8_t xh                     : 1;
  uint8_t yl                     : 1;
  uint8_t yh                     : 1;
  uint8_t zl                     : 1;
  uint8_t zh                     : 1;
  uint8_t ia                     : 1;
  uint8_t not_used_01            : 1;
} lsm303agr_int2_src_a_t;

#define LSM303AGR_INT2_THS_A                0x36U
typedef struct {
  uint8_t ths                    : 7;
  uint8_t not_used_01            : 1;
} lsm303agr_int2_ths_a_t;

#define LSM303AGR_INT2_DURATION_A           0x37U
typedef struct {
  uint8_t d                      : 7;
  uint8_t not_used_01            : 1;
} lsm303agr_int2_duration_a_t;

#define LSM303AGR_CLICK_CFG_A               0x38U
typedef struct {
  uint8_t xs                     : 1;
  uint8_t xd                     : 1;
  uint8_t ys                     : 1;
  uint8_t yd                     : 1;
  uint8_t zs                     : 1;
  uint8_t zd                     : 1;
  uint8_t not_used_01            : 2;
} lsm303agr_click_cfg_a_t;

#define LSM303AGR_CLICK_SRC_A               0x39U
typedef struct {
  uint8_t x                      : 1;
  uint8_t y                      : 1;
  uint8_t z                      : 1;
  uint8_t sign                   : 1;
  uint8_t sclick                 : 1;
  uint8_t dclick                 : 1;
  uint8_t ia                     : 1;
  uint8_t not_used_01            : 1;
} lsm303agr_click_src_a_t;

#define LSM303AGR_CLICK_THS_A               0x3AU
typedef struct {
  uint8_t ths                    : 7;
  uint8_t not_used_01            : 1;
} lsm303agr_click_ths_a_t;

#define LSM303AGR_TIME_LIMIT_A              0x3BU
typedef struct {
  uint8_t tli                    : 7;
  uint8_t not_used_01            : 1;
} lsm303agr_time_limit_a_t;

#define LSM303AGR_TIME_LATENCY_A            0x3CU
typedef struct {
  uint8_t tla                    : 8;
} lsm303agr_time_latency_a_t;

#define LSM303AGR_TIME_WINDOW_A             0x3DU
typedef struct {
  uint8_t tw                     : 8;
} lsm303agr_time_window_a_t;

#define LSM303AGR_ACT_THS_A                 0x3EU
typedef struct {
  uint8_t acth                   : 7;
  uint8_t not_used_01            : 1;
} lsm303agr_act_ths_a_t;

#define LSM303AGR_ACT_DUR_A                 0x3FU
typedef struct {
  uint8_t actd                   : 8;
} lsm303agr_act_dur_a_t;

#define LSM303AGR_OFFSET_X_REG_L_M          0x45U
#define LSM303AGR_OFFSET_X_REG_H_M          0x46U
#define LSM303AGR_OFFSET_Y_REG_L_M          0x47U
#define LSM303AGR_OFFSET_Y_REG_H_M          0x48U
#define LSM303AGR_OFFSET_Z_REG_L_M          0x49U
#define LSM303AGR_OFFSET_Z_REG_H_M          0x4AU
#define LSM303AGR_WHO_AM_I_M                0x4FU
#define LSM303AGR_CFG_REG_A_M               0x60U
typedef struct {
  uint8_t md                     : 2;
  uint8_t odr                    : 2;
  uint8_t lp                     : 1;
  uint8_t soft_rst               : 1;
  uint8_t reboot                 : 1;
  uint8_t comp_temp_en           : 1;
} lsm303agr_cfg_reg_a_m_t;

#define LSM303AGR_CFG_REG_B_M               0x61U
typedef struct {
  uint8_t lpf                    : 1;
  uint8_t set_rst                : 2; /* OFF_CANC + Set_FREQ */
  uint8_t int_on_dataoff         : 1;
  uint8_t off_canc_one_shot      : 1;
  uint8_t not_used_01            : 3;
} lsm303agr_cfg_reg_b_m_t;

#define LSM303AGR_CFG_REG_C_M               0x62U
typedef struct {
  uint8_t int_mag                : 1;
  uint8_t self_test              : 1;
  uint8_t not_used_01            : 1;
  uint8_t ble                    : 1;
  uint8_t bdu                    : 1;
  uint8_t i2c_dis                : 1;
  uint8_t int_mag_pin            : 1;
  uint8_t not_used_02            : 1;
} lsm303agr_cfg_reg_c_m_t;

#define LSM303AGR_INT_CRTL_REG_M            0x63U
typedef struct {
  uint8_t ien                    : 1;
  uint8_t iel                    : 1;
  uint8_t iea                    : 1;
  uint8_t not_used_01            : 2;
  uint8_t zien                   : 1;
  uint8_t yien                   : 1;
  uint8_t xien                   : 1;
} lsm303agr_int_crtl_reg_m_t;

